       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALIASKIL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SOME-GROUP.
          05 CHILD-A PIC X.
          05 CHILD-B PIC X.
       01 SOMETEXT PIC S99V9.
       01 REDEF-SOMETEXT REDEFINES SOMETEXT PIC XXX.
       01 NUMERIC-SOMETEXT REDEFINES SOMETEXT PIC 99.
       01 SOME-TABLE.
          05 TABLE-ITEM PIC X OCCURS 3.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE "A" TO CHILD-A
           MOVE "B" TO SOME-GROUP
           MOVE "C" TO REDEF-SOMETEXT
           MOVE "D" TO TABLE-ITEM(1)
           GOBACK.
