       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYBOOK-OWNER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01  LOCAL-FIELD PIC X(4) VALUE 'MAIN'.
           COPY OWNCPY.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY LOCAL-FIELD.
           DISPLAY COPY-FIELD.
           GOBACK.
