       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISSING-COPYBOOK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY DOES-NOT-EXIST.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "FAIL".
