       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISSING-PROC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WS-FLAG PIC X VALUE "Y".
