       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTPUTK.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO "INFILE".
       DATA DIVISION.
       FILE SECTION.
       FD  IN-FILE.
       01  IN-REC          PIC X(10).
       WORKING-STORAGE SECTION.
       01 WS-READ PIC 9(4).
       01 WS-STRING PIC 9(4).
       01 WS-UNSTRING PIC 9(4).
       01 WS-INSPECT PIC 9(4).
       01 WS-CICS PIC 9(4).
       01 WS-SQL PIC 9(4).
       01 WS-SOURCE PIC X(10).
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 10 TO WS-READ
           READ IN-FILE INTO WS-READ
               AT END CONTINUE
           END-READ
           MOVE 20 TO WS-STRING
           STRING "12" DELIMITED BY SIZE
               INTO WS-STRING
           END-STRING
           MOVE 30 TO WS-UNSTRING
           UNSTRING WS-SOURCE DELIMITED BY SPACE
               INTO WS-UNSTRING
           END-UNSTRING
           MOVE 40 TO WS-INSPECT
           INSPECT WS-INSPECT REPLACING ALL "4" BY "5"
           MOVE 50 TO WS-CICS
           EXEC CICS RECEIVE INTO(WS-CICS) END-EXEC
           MOVE 60 TO WS-SQL
           EXEC SQL SELECT AMOUNT INTO :WS-SQL FROM ACCOUNT END-EXEC
           GOBACK.
